/*=====================================================================
 * 文件：main.c
 * 说明：APP 主程序（OTA 客户端）
 * 负责：D（主循环整合），A/C 各自往 ActiveEvent 里加逻辑
 *
 * ★初始化顺序很重要，不要随便调★
 *====================================================================*/
#include "common.h"
#include "usart.h"
#include "delay.h"
#include "i2c.h"
#include "eeprom.h"
#include "spi.h"
#include "cat1.h"
#include "mqtt.h"
/*=====================================================================
 * 函数：main
 * 功能：程序入口
 * 参数：无
 * 返回：int（不会返回）
 * 负责：D
 *====================================================================*/
int main(void)
{
    /* 初始化 USART1（PA9/PA10 → CH340 → 电脑）
     * 波特率必须和串口助手一致：9600 */
    Usart1_Init(USART1_BRR);

    while (1)
    {
        Usart1_SendString("Hello\r\n");
        delay_ms(1000);
    }
}
